// URLから診断タイプ取得

const params = new URLSearchParams(location.search);
const type = params.get("type");


// 診断データ

const results = {

 lion:{
  name:"パワフルライオン",
  text:"今日のあなたはとても肉食系。たんぱく質は筋肉を育てるのに重要な存在です。今日からあなたも筋トレ仲間ですね。"
  
 },

 koala:{
  name:"ヘルシーコアラ",
  text:"健康を常に意識しているあなた。たくさん誘惑がある中でもなおバランスの取れた食事を意識できることは簡単なことではありません。とても素敵ですよ。たまには息抜きしてもいいんですよ。"
 },

 pig:{
  name:"どすこいピッグ",
  text:"今日はよく食べましたね。気分もアゲアゲ。知ってますか？豚って体脂肪率がすごく低いんです。つまり揚げ物はカロリーゼロ。どんどん食べましょう。"
 },

 chameleon:{
  name:"ミーハーカメレオン",
  text:"いろんなものに手を出したくなるタイプ。できる限り知っている味を増やしたいみたいですね。人生は一度きりです、気になるものはどんどん追求していきましょう。"
 },
 
 fullElephant:{
    name:"まんぷくぞうさん" ,
    text:"とにかくお腹いっぱいになるものを食べたかった気分ですか？満腹になることはお腹も心も満たされます。たくさん食べる人は素敵ですよ。そのまま寝ないようにだけ気をつけてください。"
 },

 heavyElephant:{
    name:"胃もたれぞうさん" ,
    text:"そんなにお腹が空いてたんですか？美味しそうにたくさん食べる姿はとても魅力的ですが、少し心配になります。明日は胃腸を休ませてあげてくださいね。"
 },

 panda:{
    name:"もぐもぐパンダ" ,
    text:"海外旅行気分になりたい日。食事は一番簡単に文化を感じられる存在ですよね。口だけ飛び立った気分ですね。実はパンダって肉食なんですよ？次は目でも楽しんでください。"
 },

 cheetah:{
    name:"せっかちチーター" ,
    text:"お腹が空いてると何でもいいから早く食べたくなりますよね。わかります。早食いは身体に良くないので気をつけてくださいね。"
 },

 snake:{
    name:"呑んべえヘビ" ,
    text:"気づけば選んでいるのは度数高めのお酒。焼酎や日本酒などもぐいぐい進むタイプです。「まだいける」が口ぐせになっているかもしれません。翌日の予定は大丈夫ですか？"
 },

 rabbit:{
    name:"フッ軽うさぎ" ,
    text:"軽めでさっぱりした料理を選びがちなタイプ。お腹にやさしく、重くならないのがポイントです。つまりこれは、次の予定や二軒目にもすぐ動ける準備万端ということ。ぴょんっと行きましょう。"
 },

 japaneseStyle:{
    name:"日本人" ,
    text:"和食を選びがちなタイプ。知っていますか？日本人の主食はお米なんです。つまりこれは、とても自然なこと。お米を頼んでしまうのは、もはや本能かもしれません。"
 },

 alpaca:{
    name:"アルパカソムリエ" ,
    text:"おしゃれでフルーティーなものを選びがちなタイプ。実はアルパカはグルメで、繊細な味を好むと言われています。つまりこれは、かなりのソムリエ気質ということ。"
 },

 pelican:{
    name:"おてんばペリカン" ,
    text:"魚料理をよく選ぶあなた。ペリカンといえば大きなくちばしで魚をぱくっと食べる鳥。もしかしてその豪快さ、ちょっと似ていませんか。"
 },

 bear:{
    name:"ブラウンくまさん" ,
    text:"茶色い料理をよく選ぶあなた。くまは森で見つけたものをぱくぱく食べる雑食家です。茶色いものが好きなのも納得かもしれません。"
 },

 raccoonDog:{
    name:"あまあまたぬき",
    text:"甘いものをつい選びがちなあなた。たぬきは甘党で知られる動物です。気づけばまた、甘い誘惑に負けていませんか。"
 }

};


// 表示

const result = results[type];

document.getElementById("result-name").textContent = result.name;
document.getElementById("result-text").textContent = result.text;


// QRコード生成

new QRCode(
 document.getElementById("qr"),
 location.href
);

